In [1]:
import pandas as pd
import numpy as np

In [2]:
dados = {
    "Nome": ["Ana", "Bruno", "Carla", "Diego", "Elisa"],
    'Idade': [23, 29, np.nan, 35, 40],
    'Cidade': ["SP", "RJ", "BH", "SP", None],
    "Salario": [3500, 4200, 3900, None, 5000]
}

df = pd.DataFrame(dados)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     5 non-null      object
 1   Idade    4 non-null      float64
 2   Cidade   4 non-null      object
 3   Salario  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [3]:
df["Salario"] = df["Salario"].fillna(0)
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     5 non-null      object
 1   Idade    4 non-null      float64
 2   Cidade   4 non-null      object
 3   Salario  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

    Nome  Idade Cidade  Salario
0    Ana   23.0     SP   3500.0
1  Bruno   29.0     RJ   4200.0
2  Carla    NaN     BH   3900.0
3  Diego   35.0     SP      0.0
4  Elisa   40.0   None   5000.0

In [4]:
df["Idade"] = df["Idade"].fillna(df["Idade"].mean())
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     5 non-null      object
 1   Idade    5 non-null      float64
 2   Cidade   4 non-null      object
 3   Salario  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

    Nome  Idade Cidade  Salario
0    Ana  23.00     SP   3500.0
1  Bruno  29.00     RJ   4200.0
2  Carla  31.75     BH   3900.0
3  Diego  35.00     SP      0.0
4  Elisa  40.00   None   5000.0

In [6]:
df['Cidade'] = df['Cidade'].fillna('Desconhecido')
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     5 non-null      object
 1   Idade    5 non-null      float64
 2   Cidade   5 non-null      object
 3   Salario  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

    Nome  Idade        Cidade  Salario
0    Ana  23.00            SP   3500.0
1  Bruno  29.00            RJ   4200.0
2  Carla  31.75            BH   3900.0
3  Diego  35.00            SP      0.0
4  Elisa  40.00  Desconhecido   5000.0

In [ ]:
df.to_csv("funcionarios.csv", sep=",", index=False)